In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('aluguel.csv', sep=';')

In [5]:
df

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
...,...,...,...,...,...,...,...,...,...
32955,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
32956,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN
32959,Conjunto Comercial/Sala,Centro,0,0,0,250,6500.0,4206.0,1109.0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

Informações gerais sobre Base de dados

In [7]:
df.dtypes

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

In [10]:
df_tipos = pd.DataFrame(df.dtypes, columns=['Tipos de Dados'])

In [12]:
df_tipos.columns.name = 'Variáveis'

In [13]:
df_tipos

Variáveis  Tipos de Dados
Tipo               object
Bairro             object
Quartos             int64
Vagas               int64
Suites              int64
Area                int64
Valor             float64
Condominio        float64
IPTU              float64

In [15]:
df.shape

(32960, 9)

In [17]:
df.shape[0]

32960

In [18]:
df.shape[1]

9

In [20]:
print('A base apresenta {} registros (imóveis) e {} variáveis'.format(df.shape[0], df.shape[1]))

A base apresenta 32960 registros (imóveis) e 9 variáveis

In [22]:
data = [
    ['Diogo', 10, 9.5, 'APROVADO'],
    ['Eric', 10, 9.5, 'APROVADO'],
    ['Du', 10, 9.5, 'REPROVADO'],
    ['Adriano', 10, 9.5, 'APROVADO'],
    ['Felipe', 10, 9.5, 'APROVADO']
]

In [23]:
data

[['Diogo', 10, 9.5, 'APROVADO'],
 ['Eric', 10, 9.5, 'APROVADO'],
 ['Du', 10, 9.5, 'REPROVADO'],
 ['Adriano', 10, 9.5, 'APROVADO'],
 ['Felipe', 10, 9.5, 'APROVADO']]

In [24]:
dados = pd.DataFrame(data, columns=['Aluno', 'P1', 'P2', 'SITUAÇÃO'])

In [25]:
dados

     Aluno  P1   P2   SITUAÇÃO
0    Diogo  10  9.5   APROVADO
1     Eric  10  9.5   APROVADO
2       Du  10  9.5  REPROVADO
3  Adriano  10  9.5   APROVADO
4   Felipe  10  9.5   APROVADO

In [28]:
dados_tipos = pd.DataFrame(dados.dtypes, columns=['Tipos de variáveis'])

In [30]:
dados_tipos.columns.name = 'Variáveis'

In [31]:
dados_tipos

Variáveis Tipos de variáveis
Aluno                 object
P1                     int64
P2                   float64
SITUAÇÃO              object